pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR16DU32def.inc
; TWI_MCTRLB masks
.equ TWI_MCMD_gm = 0x03                  ; Command group mask
.equ TWI_MCMD_gp = 0                     ; Command group position
.equ TWI_MCMD_0_bm = (1<<0)              ; Command bit 0 mask
.equ TWI_MCMD_0_bp = 0                   ; Command bit 0 position
.equ TWI_MCMD_1_bm = (1<<1)              ; Command bit 1 mask
.equ TWI_MCMD_1_bp = 1                   ; Command bit 1 position
.equ TWI_ACKACT_bm = 0x04                ; Acknowledge Action bit mask
.equ TWI_ACKACT_bp = 2                   ; Acknowledge Action bit position
.equ TWI_FLUSH_bm = 0x08                 ; Flush bit mask
.equ TWI_FLUSH_bp = 3                    ; Flush bit position

; TWI_MSTATUS masks
.equ TWI_BUSSTATE_gm = 0x03              ; Bus State group mask
.equ TWI_BUSSTATE_gp = 0                 ; Bus State group position
.equ TWI_BUSSTATE_0_bm = (1<<0)          ; Bus State bit 0 mask
.equ TWI_BUSSTATE_0_bp = 0               ; Bus State bit 0 position
.equ TWI_BUSSTATE_1_bm = (1<<1)          ; Bus State bit 1 mask
.equ TWI_BUSSTATE_1_bp = 1               ; Bus State bit 1 position
.equ TWI_BUSERR_bm = 0x04                ; Bus Error bit mask
.equ TWI_BUSERR_bp = 2                   ; Bus Error bit position
.equ TWI_ARBLOST_bm = 0x08               ; Arbitration Lost bit mask
.equ TWI_ARBLOST_bp = 3                  ; Arbitration Lost bit position
.equ TWI_RXACK_bm = 0x10                 ; Received Acknowledge bit mask
.equ TWI_RXACK_bp = 4                    ; Received Acknowledge bit position
.equ TWI_CLKHOLD_bm = 0x20               ; Clock Hold bit mask
.equ TWI_CLKHOLD_bp = 5                  ; Clock Hold bit position
.equ TWI_WIF_bm = 0x40                   ; Write Interrupt Flag bit mask
.equ TWI_WIF_bp = 6                      ; Write Interrupt Flag bit position
.equ TWI_RIF_bm = 0x80                   ; Read Interrupt Flag bit mask
.equ TWI_RIF_bp = 7                      ; Read Interrupt Flag bit position

; TWI_MBAUD masks
.equ TWI_BAUD_gm = 0xFF                  ; Baud Rate group mask
.equ TWI_BAUD_gp = 0                     ; Baud Rate group position
.equ TWI_BAUD_0_bm = (1<<0)              ; Baud Rate bit 0 mask
.equ TWI_BAUD_0_bp = 0                   ; Baud Rate bit 0 position
.equ TWI_BAUD_1_bm = (1<<1)              ; Baud Rate bit 1 mask
.equ TWI_BAUD_1_bp = 1                   ; Baud Rate bit 1 position
.equ TWI_BAUD_2_bm = (1<<2)              ; Baud Rate bit 2 mask
.equ TWI_BAUD_2_bp = 2                   ; Baud Rate bit 2 position
.equ TWI_BAUD_3_bm = (1<<3)              ; Baud Rate bit 3 mask
.equ TWI_BAUD_3_bp = 3                   ; Baud Rate bit 3 position
.equ TWI_BAUD_4_bm = (1<<4)              ; Baud Rate bit 4 mask
.equ TWI_BAUD_4_bp = 4                   ; Baud Rate bit 4 position
.equ TWI_BAUD_5_bm = (1<<5)              ; Baud Rate bit 5 mask
.equ TWI_BAUD_5_bp = 5                   ; Baud Rate bit 5 position
.equ TWI_BAUD_6_bm = (1<<6)              ; Baud Rate bit 6 mask
.equ TWI_BAUD_6_bp = 6                   ; Baud Rate bit 6 position
.equ TWI_BAUD_7_bm = (1<<7)              ; Baud Rate bit 7 mask
.equ TWI_BAUD_7_bp = 7                   ; Baud Rate bit 7 position

; TWI_MADDR masks
.equ TWI_ADDR_gm = 0xFF                  ; Address group mask
.equ TWI_ADDR_gp = 0                     ; Address group position
.equ TWI_ADDR_0_bm = (1<<0)              ; Address bit 0 mask
.equ TWI_ADDR_0_bp = 0                   ; Address bit 0 position
.equ TWI_ADDR_1_bm = (1<<1)              ; Address bit 1 mask
.equ TWI_ADDR_1_bp = 1                   ; Address bit 1 position
.equ TWI_ADDR_2_bm = (1<<2)              ; Address bit 2 mask
.equ TWI_ADDR_2_bp = 2                   ; Address bit 2 position
.equ TWI_ADDR_3_bm = (1<<3)              ; Address bit 3 mask
.equ TWI_ADDR_3_bp = 3                   ; Address bit 3 position
.equ TWI_ADDR_4_bm = (1<<4)              ; Address bit 4 mask
.equ TWI_ADDR_4_bp = 4                   ; Address bit 4 position
.equ TWI_ADDR_5_bm = (1<<5)              ; Address bit 5 mask
.equ TWI_ADDR_5_bp = 5                   ; Address bit 5 position
.equ TWI_ADDR_6_bm = (1<<6)              ; Address bit 6 mask
.equ TWI_ADDR_6_bp = 6                   ; Address bit 6 position
.equ TWI_ADDR_7_bm = (1<<7)              ; Address bit 7 mask
.equ TWI_ADDR_7_bp = 7                   ; Address bit 7 position

; TWI_MDATA masks
.equ TWI_DATA_gm = 0xFF                  ; Data group mask
.equ TWI_DATA_gp = 0                     ; Data group position
.equ TWI_DATA_0_bm = (1<<0)              ; Data bit 0 mask
.equ TWI_DATA_0_bp = 0                   ; Data bit 0 position
.equ TWI_DATA_1_bm = (1<<1)              ; Data bit 1 mask
.equ TWI_DATA_1_bp = 1                   ; Data bit 1 position
.equ TWI_DATA_2_bm = (1<<2)              ; Data bit 2 mask
.equ TWI_DATA_2_bp = 2                   ; Data bit 2 position
.equ TWI_DATA_3_bm = (1<<3)              ; Data bit 3 mask
.equ TWI_DATA_3_bp = 3                   ; Data bit 3 position
.equ TWI_DATA_4_bm = (1<<4)              ; Data bit 4 mask
.equ TWI_DATA_4_bp = 4                   ; Data bit 4 position
.equ TWI_DATA_5_bm = (1<<5)              ; Data bit 5 mask
.equ TWI_DATA_5_bp = 5                   ; Data bit 5 position
.equ TWI_DATA_6_bm = (1<<6)              ; Data bit 6 mask
.equ TWI_DATA_6_bp = 6                   ; Data bit 6 position
.equ TWI_DATA_7_bm = (1<<7)              ; Data bit 7 mask
.equ TWI_DATA_7_bp = 7                   ; Data bit 7 position

; TWI_SCTRLA masks
; Masks for TWI_ENABLE already defined
; Masks for TWI_SMEN already defined
.equ TWI_PMEN_bm = 0x04                  ; Address Recognition Mode bit mask
.equ TWI_PMEN_bp = 2                     ; Address Recognition Mode bit position
.equ TWI_PIEN_bm = 0x20                  ; Stop Interrupt Enable bit mask
.equ TWI_PIEN_bp = 5                     ; Stop Interrupt Enable bit position
.equ TWI_APIEN_bm = 0x40                 ; Address or Stop Interrupt Enable bit mask
.equ TWI_APIEN_bp = 6                    ; Address or Stop Interrupt Enable bit position
.equ TWI_DIEN_bm = 0x80                  ; Data Interrupt Enable bit mask
.equ TWI_DIEN_bp = 7                     ; Data Interrupt Enable bit position

; TWI_SCTRLB masks
.equ TWI_SCMD_gm = 0x03                  ; Command group mask
.equ TWI_SCMD_gp = 0                     ; Command group position
.equ TWI_SCMD_0_bm = (1<<0)              ; Command bit 0 mask
.equ TWI_SCMD_0_bp = 0                   ; Command bit 0 position
.equ TWI_SCMD_1_bm = (1<<1)              ; Command bit 1 mask
.equ TWI_SCMD_1_bp = 1                   ; Command bit 1 position
; Masks for TWI_ACKACT already defined

; TWI_SSTATUS masks
.equ TWI_AP_bm = 0x01                    ; Address or Stop bit mask
.equ TWI_AP_bp = 0                       ; Address or Stop bit position
.equ TWI_DIR_bm = 0x02                   ; Read/Write Direction bit mask
.equ TWI_DIR_bp = 1                      ; Read/Write Direction bit position
; Masks for TWI_BUSERR already defined
.equ TWI_COLL_bm = 0x08                  ; Collision bit mask
.equ TWI_COLL_bp = 3                     ; Collision bit position
; Masks for TWI_RXACK already defined
; Masks for TWI_CLKHOLD already defined
.equ TWI_APIF_bm = 0x40                  ; Address or Stop Interrupt Flag bit mask
.equ TWI_APIF_bp = 6                     ; Address or Stop Interrupt Flag bit position
.equ TWI_DIF_bm = 0x80                   ; Data Interrupt Flag bit mask
.equ TWI_DIF_bp = 7                      ; Data Interrupt Flag bit position

; TWI_SADDR masks
; Masks for TWI_ADDR already defined

; TWI_SDATA masks
; Masks for TWI_DATA already defined

